export default {
    //选中不同类型图元后，工具条按钮状态
    toolbarState: {
        node: ['删除','撤销','重做','放大','缩小','漫游','左对齐','右对齐','顶对齐','底对齐','水平居中','垂直居中','水平镜像','垂直镜像'],
        blank: ['新建','打开','保存','撤销','重做','放大','缩小','漫游','画笔','直线','折线','曲线'],
        edge: ['删除','撤销','重做','放大','缩小','漫游','左对齐','水平镜像','垂直镜像','画笔颜色','填充','单线','虚线'],
        text: ['文字','加粗','斜体']
    },
    graphOptions: {
        zoomIn: 0.2,
        zoomOut: -0.2, 
    },
    portsStyle:{
        width: 2,
        fill: '#ffffff'
    },
    rightBtnMenu:{
        default: ['缩小','放大'],
        node:['上移','下移','旋转','删除','编辑'],
        edge:['旋转','删除','编辑']
    }
}